Autodesk.Revit.DB.Structure.RebarContainer.SetHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
The element that contains the rebar.
doc:
The document containing both this element and the host element.
hostId:
The element that the rebar object belongs to, such as a structural
wall, floor, foundation, beam, brace or column. The rebar does not need
to be strictly inside the host, but it must be assigned to one host
element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostId is not a legal Rebar Container host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.SetSolidInView(Autodesk.Revit.DB.View3D,System.Boolean)
Sets this RebarContainer element is shown as solid in the given 3D view.
view:
The 3D view element
solid:
True if this RebarContainer element is shown as solid in the given 3D view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar container element doesn't have valid visibility data.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.IsSolidInView(Autodesk.Revit.DB.View3D)
Checks if this RebarContainer element is shown as solid in the given 3D view.
view:
The 3D view element
Returns:
True this RebarContainer element is shown as solid in the given 3D view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar container element doesn't have valid visibility data.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this rebar container element to be shown unobscured in a view.
view:
The view element
unobscured:
True if rebar is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar container element doesn't have valid visibility data.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.SetItemHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the RebarContainerItem to be hidden or unhidden in the given view.
view:
The view.
itemIndex:
Item index in the Rebar Container.
hide:
True to hide this RebarContainerItem in the view, false to unhide the item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The item index is either less than 0 or graeter than or equal to number of items in this Rebar Container element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.RebarContainer.RemoveItem(Autodesk.Revit.DB.Structure.RebarContainerItem)
Removes Item from the Rebar Container.
pItem:
Item to be removed from this Rebar Container
Throws Autodesk.Revit.Exceptions.ArgumentException:
The item is not a member of this Rebar Container element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.AppendItemFromCurvesAndShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
normal:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Returns:
The Rebar Container Item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
The rebarShape has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
normal has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.AppendItemFromRebarShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVector:
The x-axis in the shape definition will be mapped to this direction in the project.
yVector:
The y-axis in the shape definition will be mapped to this direction in the project.
Returns:
The Rebar Container Item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarShape has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVector has zero length.
-or-
yVector has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.AppendItemFromCurves(Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
normal:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, NewRebar returns  or creates a new shape, according to the parameter createNewShape.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The Rebar Container Item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
normal has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.AppendItemFromRebar(Autodesk.Revit.DB.Structure.Rebar)
Appends an Item to the RebarContainer. Fills its data on base of the Rebar.
Will throw exception if given rebar is not shape driven.
Will throw exception if given rebar has moved bars in set.
rebar:
The Rebar.
Returns:
The Rebar Container Item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The RebarShape of rebar has End Treatments
-or-
Can't create container from free-form rebar.
-or-
Can't create container from Rebar with moved bars.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Creates a new instance of a Rebar Container element within the project.
Remarks:
Created Rebar Container starts out empty.
Use appendItemFromRebar, appendItemFromCurves, appendItemFromRebarShape, appendItemFromCurvesAndShape to fill its content.
aDoc:
A document.
hostElement:
The element that will host the RebarContainer.
rebarContainerTypeId:
The id of the RebarContainerType.
Returns:
The newly created Rebar Container instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
hostElement is not a valid rebar host.
-or-
the ElementId rebarContainerTypeId is either invalid or not a RebarContainerType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainer.ScheduleMark
The Schedule Mark parameter. On creation, the Schedule Mark is set
to a value that is unique to the host, but it can be set to
any value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2016